
nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, ConvNormLayer, [32, 3, 2, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [32, 3, 1, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [64, 3, 1, None, False, 'relu']]
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]

  - [-1, 1, Blocks, [64, BottleNeck_PConv_Rep, 3, 2, 'relu']]
  - [-1, 1, Blocks, [128, BottleNeck_PConv_Rep, 4, 3, 'relu']]
  - [-1, 1, Blocks, [256, BottleNeck_PConv_Rep, 6, 4, 'relu']]
  - [-1, 1, Blocks, [512, BottleNeck_PConv_Rep, 3, 5, 'relu']]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]
  - [-1, 1, AIFI, [1024, 8]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [[4, 5, 6, 7], 1, SimFusion_4in, []]
  - [-1, 1, IFM, [[64, 32]]]

  - [10, 1, Conv, [256, 1, 1]]
  - [[5, 6, -1], 1, SimFusion_3in, [256]]
  - [[-1, 12], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 0]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [6, 1, Conv, [256, 1, 1]]
  - [[4, 5, -1], 1, SimFusion_3in, [256]]
  - [[-1, 12], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [[20, 16, 10], 1, PyramidPoolAgg, [352, 2]]
  - [-1, 1, TopBasicLayer, [352, [64, 128]]]

  - [[20, 17], 1, AdvPoolFusion, []]
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]]
  - [-1, 3, RepC3, [256, 0.5]]

  - [[-1, 13], 1, AdvPoolFusion, []]
  - [[-1, 22], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 1]]
  - [-1, 3, RepC3, [256,0.5]]

  - [[20, 25, 28], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]
